imbluedabr/m33mu/cpu/mcxw71c/mcxw71c_mmio.c
static mm_bool port_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct port_state *p = (struct port_state *)opaque;
    int idx = (int)(p - ports);
    if (p == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if (!port_enabled(idx)) return MM_FALSE;
    if ((offset + size_bytes) > PORT_SIZE) return MM_FALSE;

    if (size_bytes == 4) {
        if (offset >= PORT_PCR0 && offset < PORT_PCR0 + 0x18u) {
            int pin = (int)((offset - PORT_PCR0) / 4);
            port_write_pcr(p, pin, value);
            return MM_TRUE;
        }
        if (offset >= PORT_PCR16 && offset < PORT_PCR16 + 0x1Cu) {
            int pin = 16 + (int)((offset - PORT_PCR16) / 4);
            port_write_pcr(p, pin, value);
            return MM_TRUE;
        }
        if (offset == PORT_GPCLR) {
            mm_u32 gpwe = value & 0xFFFFu;
            mm_u32 gpwd = (value >> 16) & 0xFFFFu;
            int pin;
            for (pin = 0; pin < 16; ++pin) {
                if ((gpwe >> pin) & 1u) {
                    port_write_pcr(p, pin, (p->pcr[pin] & 0xFFFF0000u) | gpwd);
                }
            }
            return MM_TRUE;
        }
        if (offset == PORT_GPCHR) {
            mm_u32 gpwe = value & 0xFFFFu;
            mm_u32 gpwd = (value >> 16) & 0xFFFFu;
            int pin;
            for (pin = 0; pin < 16; ++pin) {
                if ((gpwe >> pin) & 1u) {
                    int idx_pin = 16 + pin;
                    port_write_pcr(p, idx_pin, (p->pcr[idx_pin] & 0xFFFF0000u) | gpwd);
                }
            }
            return MM_TRUE;
        }
        if (offset == PORT_EDFR) {
            p->regs[PORT_EDFR / 4] &= ~value;
            return MM_TRUE;
        }
    }
    memcpy((mm_u8 *)p->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static mm_u32 mcxw71c_gpio_bank_read(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= 4) return 0;
    return gpio_banks[bank].regs[GPIO_PDOR / 4];
}

static mm_u32 mcxw71c_gpio_bank_read_moder(void *opaque, int bank)
{
    mm_u32 moder = 0;
    mm_u32 pddr;
    int pin;
    int port_idx;
    (void)opaque;
    if (bank < 0 || bank >= 4) return 0;
    pddr = gpio_banks[bank].regs[GPIO_PDDR / 4];
    port_idx = port_index_for_bank(bank);
    for (pin = 0; pin < 16; ++pin) {
        mm_u32 mux = 0;
        if (port_idx >= 0) {
            mux = (ports[port_idx].pcr[pin] & PORT_PCR_MUX_MASK) >> PORT_PCR_MUX_SHIFT;
        }
        if (mux == 0u) {
            /* Disabled */
        } else if (mux == 1u) {
            if ((pddr >> pin) & 1u) {
                moder |= (1u << (pin * 2));
            }
        } else {
            moder |= (2u << (pin * 2)); /* peripheral */
        }
    }
    return moder;
}

static mm_bool mcxw71c_gpio_bank_clock(void *opaque, int bank)
{
    (void)opaque;
    switch (bank) {
    case 0:
        return mm_mcxw71c_mrcc_clock_on(MCXW71C_MRCC_GPIOA) &&
               mm_mcxw71c_mrcc_reset_released(MCXW71C_MRCC_GPIOA);
    case 1:
        return mm_mcxw71c_mrcc_clock_on(MCXW71C_MRCC_GPIOB) &&
               mm_mcxw71c_mrcc_reset_released(MCXW71C_MRCC_GPIOB);
    case 2:
        return mm_mcxw71c_mrcc_clock_on(MCXW71C_MRCC_GPIOC) &&
               mm_mcxw71c_mrcc_reset_released(MCXW71C_MRCC_GPIOC);
    default:
        return MM_TRUE;
    }
}

static mm_u32 mcxw71c_gpio_bank_read_seccfgr(void *opaque, int bank)
{
    (void)opaque;
    (void)bank;
    return 0;
}

static mm_bool mcxw71c_gpio_bank_info(void *opaque, int bank, char *name_out, size_t name_len, int *pins_out)
{
    static const int pin_counts[] = { 9, 6, 8, 6 };
    (void)opaque;
    if (bank < 0 || bank >= 4) {
        return MM_FALSE;
    }
    if (name_out != 0 && name_len > 0u) {
        name_out[0] = (char)('A' + bank);
        if (name_len > 1u) {
            name_out[1] = '\0';
        }
    }
    if (pins_out != 0) {
        *pins_out = pin_counts[bank];
    }
    return MM_TRUE;
}

struct mrcc_clk_name {
    const char *name;
    mm_u32 offset;
};

static const struct mrcc_clk_name mrcc_clk_names[] = {
    { "LPIT0", MCXW71C_MRCC_LPIT0 },
    { "LPSPI0", MCXW71C_MRCC_LPSPI0 },
    { "LPSPI1", MCXW71C_MRCC_LPSPI1 },
    { "LPUART0", MCXW71C_MRCC_LPUART0 },
    { "LPUART1", MCXW71C_MRCC_LPUART1 },
    { "PORTA", MCXW71C_MRCC_PORTA },
    { "PORTB", MCXW71C_MRCC_PORTB },
    { "PORTC", MCXW71C_MRCC_PORTC },
    { "GPIOA", MCXW71C_MRCC_GPIOA },
    { "GPIOB", MCXW71C_MRCC_GPIOB },
    { "GPIOC", MCXW71C_MRCC_GPIOC }
};

static mm_bool mcxw71c_rcc_clock_list_line(void *opaque, int line, char *out, size_t out_len)
{
    char buf[256];
    size_t pos = 0;
    size_t i;
    mm_bool have = MM_FALSE;
    (void)opaque;
    if (out == 0 || out_len == 0u) {
        return MM_FALSE;
    }
    if (line != 0) {
        return MM_FALSE;
    }
    pos += snprintf(buf + pos, sizeof(buf) - pos, "MRCC:");
    for (i = 0; i < sizeof(mrcc_clk_names) / sizeof(mrcc_clk_names[0]); ++i) {
        if (!mm_mcxw71c_mrcc_clock_on(mrcc_clk_names[i].offset)) {
            continue;
        }
        if (pos + 2u < sizeof(buf)) {
            pos += snprintf(buf + pos, sizeof(buf) - pos, " %s", mrcc_clk_names[i].name);
            have = MM_TRUE;
        }
    }
    if (!have) {
        return MM_FALSE;
    }
    snprintf(out, out_len, "%s", buf);
    return MM_TRUE;
}

void mm_mcxw71c_mmio_reset(void)
{
    memset(gpio_banks, 0, sizeof(gpio_banks));
    memset(&mrcc, 0, sizeof(mrcc));
    memset(&wdog, 0, sizeof(wdog));
    memset(&scg, 0, sizeof(scg));
    memset(&ccm32k, 0, sizeof(ccm32k));
    memset(&vbat, 0, sizeof(vbat));
    memset(ports, 0, sizeof(ports));
    g_gpio_nvic = 0;
    mrcc.regs[MCXW71C_MRCC_LPIT0 / 4] = 0x80000000u;
    mrcc.regs[MCXW71C_MRCC_LPSPI0 / 4] = 0x80000000u;
    mrcc.regs[MCXW71C_MRCC_LPSPI1 / 4] = 0x80000000u;
    mrcc.regs[MCXW71C_MRCC_LPUART0 / 4] = 0x80000000u;
    mrcc.regs[MCXW71C_MRCC_LPUART1 / 4] = 0x80000000u;
    /* PORT/GPIO blocks are reachable during early pinctrl on Zephyr. */
    mrcc.regs[MCXW71C_MRCC_PORTA / 4] = 0xC0000001u;
    mrcc.regs[MCXW71C_MRCC_PORTB / 4] = 0xC0000001u;
    mrcc.regs[MCXW71C_MRCC_PORTC / 4] = 0xC0000001u;
    mrcc.regs[MCXW71C_MRCC_GPIOA / 4] = 0xC0000001u;
    mrcc.regs[MCXW71C_MRCC_GPIOB / 4] = 0xC0000001u;
    mrcc.regs[MCXW71C_MRCC_GPIOC / 4] = 0xC0000001u;
    /* SystemInit() waits for RCS, ULK and CMD32EN in WDOG0->CS. */
    wdog.regs[0x0u / 4] = (1u << 10) | (1u << 11) | (1u << 13);
    scg.regs[SCG_VERID / 4u] = 0x00000000u;
    scg.regs[SCG_PARAM / 4u] = 0x000001FEu;
    scg.regs[SCG_CSR / 4u] = 0x03000000u;
    scg.regs[SCG_RCCR / 4u] = 0x03000000u;
    scg.regs[SCG_SOSCCSR / 4u] = 0x01000020u;
    scg.regs[SCG_SIRCCSR / 4u] = 0x01000020u;
    scg.regs[SCG_FIRCCSR / 4u] = 0x03000031u;
    scg.regs[SCG_ROSCCSR / 4u] = 0x03000000u;
    ccm32k.regs[CCM32K_FRO32K_CTRL / 4u] = 0x00000001u;
    ccm32k.regs[CCM32K_STATUS / 4u] = 0x00000001u;
    ccm32k.regs[CCM32K_CGC32K / 4u] = 0x00000020u;
    vbat.regs[0x10u / 4u] = 0x00000011u;
    mm_gpio_bank_set_reader(mcxw71c_gpio_bank_read, 0);
    mm_gpio_bank_set_moder_reader(mcxw71c_gpio_bank_read_moder, 0);
    mm_gpio_bank_set_clock_reader(mcxw71c_gpio_bank_clock, 0);
    mm_gpio_bank_set_seccfgr_reader(mcxw71c_gpio_bank_read_seccfgr, 0);
    mm_gpio_set_bank_info_reader(mcxw71c_gpio_bank_info, 0);
    mm_rcc_set_clock_list_reader(mcxw71c_rcc_clock_list_line, 0);
}

mm_bool mm_mcxw71c_mrcc_clock_on(mm_u32 offset)
{
    mm_u32 reg;
    if (offset >= MRCC_SIZE) return MM_FALSE;
    reg = mrcc.regs[offset / 4];
    return ((reg & 0x3u) != 0u) ? MM_TRUE : MM_FALSE;
}

