imbluedabr/m33mu/cpu/mcxw71c/mcxw71c_mmio.c
mm_bool mm_mcxw71c_mrcc_reset_released(mm_u32 offset)
{
    mm_u32 reg;
    if (offset >= MRCC_SIZE) return MM_FALSE;
    reg = mrcc.regs[offset / 4];
    return ((reg >> 30) & 1u) ? MM_TRUE : MM_FALSE;
}

static mm_bool mrcc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct mrcc_state *m = (struct mrcc_state *)opaque;
    if (m == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > MRCC_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)m->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool mrcc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct mrcc_state *m = (struct mrcc_state *)opaque;
    mm_u32 reg;
    if (m == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > MRCC_SIZE) return MM_FALSE;
    if (size_bytes != 4) return MM_FALSE;
    reg = value | 0x80000000u; /* PR bit stays set */
    m->regs[offset / 4] = reg;
    return MM_TRUE;
}

static mm_bool wdog_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct wdog_state *w = (struct wdog_state *)opaque;
    if (w == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > WDOG_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)w->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool wdog_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct wdog_state *w = (struct wdog_state *)opaque;
    if (w == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > WDOG_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)w->regs + offset, &value, size_bytes);
    /* Keep SystemInit()-visible ready bits asserted in CS. */
    if (offset == 0x0u && size_bytes == 4u) {
        w->regs[0x0u / 4] |= (1u << 10) | (1u << 11) | (1u << 13);
    }
    return MM_TRUE;
}

static mm_bool scg_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct scg_state *s = (struct scg_state *)opaque;
    if (s == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > SCG_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)s->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool scg_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct scg_state *s = (struct scg_state *)opaque;
    const mm_u32 scs_mask = 0x0F000000u;
    if (s == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > SCG_SIZE) return MM_FALSE;
    if (size_bytes != 4) return MM_FALSE;
    if (offset == SCG_VERID || offset == SCG_PARAM) {
        return MM_TRUE;
    }
    s->regs[offset / 4u] = value;
    if (offset == SCG_RCCR) {
        mm_u32 csr = s->regs[SCG_CSR / 4u] & ~scs_mask;
        s->regs[SCG_CSR / 4u] = csr | (value & scs_mask);
    } else if (offset == SCG_SOSCCSR || offset == SCG_SIRCCSR || offset == SCG_FIRCCSR) {
        s->regs[offset / 4u] |= (1u << 24) | (1u << 5);
    } else if (offset == SCG_ROSCCSR) {
        s->regs[offset / 4u] |= (1u << 24) | (1u << 25);
    }
    return MM_TRUE;
}

static mm_bool ccm32k_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct ccm32k_state *c = (struct ccm32k_state *)opaque;
    if (c == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > CCM32K_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)c->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool ccm32k_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct ccm32k_state *c = (struct ccm32k_state *)opaque;
    if (c == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > CCM32K_SIZE) return MM_FALSE;
    if (offset == CCM32K_STATUS) {
        return MM_TRUE;
    }
    memcpy((mm_u8 *)c->regs + offset, &value, size_bytes);
    if (offset == CCM32K_FRO32K_CTRL || offset == CCM32K_OSC32K_CTRL || offset == CCM32K_CGC32K) {
        c->regs[CCM32K_STATUS / 4u] |= 1u;
        scg.regs[SCG_ROSCCSR / 4u] |= (1u << 24) | (1u << 25);
    }
    return MM_TRUE;
}

static mm_bool vbat_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct vbat_state *v = (struct vbat_state *)opaque;
    if (v == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > VBAT_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)v->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool vbat_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct vbat_state *v = (struct vbat_state *)opaque;
    if (v == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > VBAT_SIZE) return MM_FALSE;
    memcpy((mm_u8 *)v->regs + offset, &value, size_bytes);
    /* Keep LDO ready asserted and allow STATUSA flag clearing writes. */
    if (offset == 0x10u && size_bytes == 4u) {
        v->regs[0x10u / 4u] = (v->regs[0x10u / 4u] & ~value) | 0x10u;
    }
    return MM_TRUE;
}

mm_bool mm_mcxw71c_register_mmio(struct mmio_bus *bus)
{
    struct mmio_region reg;
    if (bus == 0) return MM_FALSE;

    reg.base = MRCC_BASE;
    reg.size = MRCC_SIZE;
    reg.opaque = &mrcc;
    reg.read = mrcc_read;
    reg.write = mrcc_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = MRCC_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = WDOG_BASE;
    reg.size = WDOG_SIZE;
    reg.opaque = &wdog;
    reg.read = wdog_read;
    reg.write = wdog_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = WDOG_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = SCG_BASE;
    reg.size = SCG_SIZE;
    reg.opaque = &scg;
    reg.read = scg_read;
    reg.write = scg_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = SCG_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = CCM32K_BASE;
    reg.size = CCM32K_SIZE;
    reg.opaque = &ccm32k;
    reg.read = ccm32k_read;
    reg.write = ccm32k_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = CCM32K_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = VBAT_BASE;
    reg.size = VBAT_SIZE;
    reg.opaque = &vbat;
    reg.read = vbat_read;
    reg.write = vbat_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = VBAT_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = GPIO_SIZE;
    reg.read = gpio_read;
    reg.write = gpio_write;

    /* GPIOA */
    reg.base = GPIOA_BASE;
    reg.opaque = &gpio_banks[0];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIOA_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GPIOB */
    reg.base = GPIOB_BASE;
    reg.opaque = &gpio_banks[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIOB_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GPIOC */
    reg.base = GPIOC_BASE;
    reg.opaque = &gpio_banks[2];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIOC_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* GPIOD */
    reg.base = GPIOD_BASE;
    reg.opaque = &gpio_banks[3];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIOD_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* PORTA/B/C */
    reg.base = PORTA_BASE;
    reg.size = PORT_SIZE;
    reg.opaque = &ports[0];
    reg.read = port_read;
    reg.write = port_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = PORTA_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = PORTB_BASE;
    reg.opaque = &ports[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = PORTB_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = PORTC_BASE;
    reg.opaque = &ports[2];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = PORTC_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    return MM_TRUE;
}

void mm_mcxw71c_flash_bind(struct mm_memmap *map,
                           mm_u8 *flash,
                           mm_u32 flash_size,
                           const struct mm_flash_persist *persist,
                           mm_u32 flags)
{
    (void)map;
    (void)flash;
    (void)flash_size;
    (void)persist;
    (void)flags;
}

mm_u64 mm_mcxw71c_cpu_hz(void)
{
    return 48000000ull;
}
